<!-- Modal -->
<div class="modal fade color-2" id="privacyModal" data-bs-keyboard="false" tabindex="-1" aria-labelledby="privacyModalLabel" aria-hidden="true">
  <div class="modal-dialog  modal-xl">
    <div class="modal-content privacy_modal__content">
      <div class="modal-header">
        <button type="button" class="btn-close" data-bs-dismiss="modal" aria-label="Close"></button>
      </div>
      <div class="modal-body modal-dialog-scrollable">
        <div>
          <h3>О нас</h3>
          <p>
          Адрес нашего сайта: https://mirta.ae.
          </p>

          <h3>Комментарии</h3>
          <p>
          Когда посетители оставляют комментарии на сайте, мы собираем данные, показанные в форме комментариев, а также IP-адрес посетителя и строку пользовательского агента браузера, чтобы помочь в обнаружении спама.
          </p>

          <p>
          Анонимизированная строка, созданная на основе вашего адреса электронной почты (также называемая хешем), может быть предоставлена ​​службе Gravatar, чтобы проверить, используете ли вы ее. Политика конфиденциальности сервиса Gravatar доступна здесь: https://automattic.com/privacy/. После одобрения вашего комментария изображение вашего профиля станет общедоступным в контексте вашего комментария.
          </p>

          <h3>Медиа</h3>
          <p>
          Если вы загружаете изображения на веб-сайт, вам следует избегать загрузки изображений со встроенными данными о местоположении (EXIF GPS). Посетители веб-сайта могут загружать и извлекать любые данные о местоположении из изображений на веб-сайте.
          </p>

          <h3>Файлы cookie</h3>
          <p>
          Если вы оставляете комментарий на нашем сайте, вы можете дать согласие на сохранение своего имени, адреса электронной почты и веб-сайта в файлах cookie. Это сделано для вашего удобства, чтобы вам не приходилось снова вводить свои данные, когда вы оставляете следующий комментарий. Эти файлы cookie будут храниться в течение одного года.
          </p>

          <p>
          Если вы посетите нашу страницу входа в систему, мы установим временный файл cookie, чтобы определить, принимает ли ваш браузер файлы cookie. Этот файл cookie не содержит личных данных и удаляется при закрытии браузера.
          </p>

          <p>
          Когда вы входите в систему, мы также устанавливаем несколько файлов cookie для сохранения вашей информации для входа и выбора экрана. Файлы cookie для входа хранятся в течение двух дней, а файлы cookie параметров экрана — в течение года. Если вы выберете «Запомнить меня», ваш логин сохранится в течение двух недель. Если вы выйдете из своей учетной записи, файлы cookie для входа будут удалены.
          </p>

          <p>
          Если вы редактируете или публикуете статью, в вашем браузере будет сохранен дополнительный файл cookie. Этот файл cookie не содержит личных данных и просто указывает идентификатор публикации статьи, которую вы только что отредактировали. Срок действия истекает через 1 день.
          </p>

          <h3>Встроенный контент с других веб-сайтов</h3>
          <p>
          Статьи на этом сайте могут включать встроенный контент (например, видео, изображения, статьи и т. д.). Встроенный контент с других веб-сайтов ведет себя точно так же, как если бы посетитель посетил другой веб-сайт.
          </p>

          <p>
          Эти веб-сайты могут собирать данные о вас, использовать файлы cookie, встраивать дополнительное стороннее отслеживание и отслеживать ваше взаимодействие с этим встроенным контентом, включая отслеживание вашего взаимодействия со встроенным контентом, если у вас есть учетная запись и вы вошли на этот веб-сайт.
          </p>

          <h3>Кому мы передаем ваши данные</h3>
          <p>
          Если вы запросите сброс пароля, ваш IP-адрес будет включен в электронное письмо для сброса пароля.
          </p>

          <h3>Как долго мы храним ваши данные</h3>
          <p>
          Если вы оставляете комментарий, комментарий и его метаданные сохраняются на неопределенный срок. Это сделано для того, чтобы мы могли автоматически распознавать и одобрять любые последующие комментарии, а не держать их в очереди на модерацию.
          </p>

          <p>
          Для пользователей, которые регистрируются на нашем веб-сайте (если таковые имеются), мы также сохраняем личную информацию, которую они предоставляют, в своем профиле пользователя. Все пользователи могут просматривать, редактировать или удалять свою личную информацию в любое время (за исключением того, что они не могут изменить свое имя пользователя). Администраторы веб-сайта также могут просматривать и редактировать эту информацию.
          </p>

          <h3>Какие права вы имеете на свои данные</h3>
          <p>
          Если у вас есть учетная запись на этом сайте или вы оставили комментарии, вы можете запросить экспортированный файл личных данных, которые мы храним о вас, включая любые данные, которые вы нам предоставили. Вы также можете потребовать, чтобы мы удалили все личные данные, которые мы храним о вас. Сюда не входят данные, которые мы обязаны хранить в административных, юридических целях или целях безопасности.
          </p>

          <h3>Куда отправляются ваши данные</h3>
          <p>
          Комментарии посетителей могут быть проверены с помощью автоматической службы обнаружения спама.
          </p>
        </div>
      </div>
    </div>


  </div>
</div>