<?php

$contact_section_button_text = ["Отправить", "Ожидайте..."];

$contact_form_text = [
  [
    "text" => "Имя",
    "id" => "contactsFieldName",
    "placeholder" => "Имя",
    "type" => "text",
    "is_required" => true,
    "errors" => [
      "general_required" => "Обязательное поле",
      "name_length" => "Имя не может быть таким длинным"
    ],
  ],
  [
    "text" => "E-mail",
    "id" => "contactsFieldEmail",
    "placeholder" => "E-mail",
    "type" => "text",
    "is_required" => true,
    "errors" => [
      "general_required" => "Обязательное поле",
      "email_length" => "E-mail не может быть таким длинным",
      "email_validate" => "Некорректный формат e-mail"
    ],
  ],
  [
    "text" => "Телефон",
    "id" => "contactsFieldPhone",
    "placeholder" => "Номер телефона",
    "type" => "text",
    "is_required" => false,
    "errors" => [
      "general_required" => "Обязательное поле",
      "phone_validate" => "Некорректный формат номера телефона"
    ],
  ],
  [
    "text" => "Telegram",
    "id" => "contactsFieldTelegram",
    "placeholder" => "Telegram username",
    "type" => "text",
    "is_required" => false,
    "errors" => [
      "general_required" => "Обязательное поле",
      "telegram_length" => "Telegram не может быть таким длинным",
      "telegram_starts_with_at" => "Telegram должен начинаться с символа @",
      "telegram_validate" => "Некорректный формат Telegram"
    ],
  ],
  [
    "text" => "Сопроводительное письмо",
    "id" => "contactsFieldMessage",
    "placeholder" => "Сопроводительное письмо",
    "type" => "text",
    "is_required" => false,
    "errors" => [
      "general_required" => "Обязательное поле",
      "message_length" => "Сообщение не может быть таким длинным",
    ],
  ],
  [
    "text" => "Даю согласие на обработку моих персональных данных",
    "id" => "contactsFieldConset",
    "placeholder" => "",
    "type" => "checkbox",
    "is_required" => true,
    "errors" => [
      "conset_validate" => "Обязательное поле",
    ],
  ]
];

$contacts_texts = [
  [
    "name" => "Email",
    "is_ref" => true,
    "ref" => "mailto:test@email.com",
    "value" => "test@email.com",
    "svg" => '
      <svg width="50" height="40" viewBox="0 0 50 40" fill="none" xmlns="http://www.w3.org/2000/svg">
        <g clip-path="url(#clip0_100_108)">
        <rect x="0.5" y="0.5" width="49" height="39" rx="1.5" stroke="currentColor"/>
        <path d="M0.863281 1.13574L24.999 25.2715L49.1348 1.13574" stroke="currentColor"/>
        </g>
        <defs>
        <clipPath id="clip0_100_108">
        <rect width="50" height="40" fill="currentColor"/>
        </clipPath>
        </defs>
      </svg>
    '
  ],
  [
    "name" => "Телефон / WhatsApp",
    "is_ref" => true,
    "ref" => "tel:+71234567890",
    "value" => "+7 123 456 78 90",
    "svg" => '
      <svg width="51" height="41" viewBox="0 0 51 41" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M0.607968 7.69688C1.25609 6.72733 3.05581 4.69343 4.95692 3.01691C5.90585 2.18007 6.85733 1.45274 7.68313 0.994504C8.09645 0.765158 8.45904 0.614142 8.76047 0.544252C9.06506 0.473629 9.26038 0.496241 9.38053 0.551025C9.74273 0.716165 10.3168 1.16192 11.0116 1.82757C11.6915 2.4789 12.4444 3.29871 13.1591 4.15978C13.8739 5.02097 14.5439 5.91544 15.0603 6.71457C15.5879 7.53077 15.9199 8.19449 16.0119 8.60849C16.0121 8.60918 16.014 8.61678 16.0101 8.63686C16.0059 8.65874 15.9949 8.69439 15.9684 8.74546C15.9133 8.85166 15.8107 8.9877 15.6482 9.15568C15.3216 9.49337 14.8438 9.87013 14.2903 10.3026L14.2422 10.3402C13.7145 10.7524 13.1336 11.2062 12.628 11.6834C12.1111 12.1713 11.6327 12.7198 11.3688 13.3205C11.2179 13.6638 11.1898 14.0631 11.2292 14.4683C11.2691 14.8783 11.3816 15.3308 11.5485 15.8069C11.8823 16.7592 12.4521 17.8578 13.1861 18.9869C14.6535 21.2445 16.8203 23.6906 19.2083 25.4061C22.1143 27.4937 25.8157 29.1349 28.9663 30.1449C30.543 30.6504 31.9963 31.0026 33.1569 31.1724C33.7363 31.2571 34.2551 31.2983 34.6862 31.2868C35.0969 31.2759 35.5048 31.2164 35.8017 31.0363C36.0734 30.8716 36.2692 30.6151 36.4157 30.3497C36.5643 30.0805 36.6828 29.7646 36.7821 29.4343C36.9725 28.8015 37.1133 28.0436 37.2462 27.3276L37.2619 27.2434C37.403 26.4845 37.5367 25.7829 37.7129 25.2458C37.8007 24.9779 37.8906 24.7788 37.9799 24.6444C38.0703 24.5087 38.1303 24.483 38.145 24.4785C38.7313 24.3009 39.6666 24.2362 40.7974 24.3026C41.9158 24.3682 43.1811 24.5593 44.4048 24.8626C45.6305 25.1664 46.7963 25.5784 47.7239 26.0777C48.6664 26.5851 49.2912 27.1442 49.5442 27.7055L49.5445 27.7064C49.5448 27.7069 49.5451 27.7078 49.5456 27.7089C49.5465 27.7114 49.5478 27.7151 49.5494 27.7199C49.5527 27.7298 49.5566 27.7435 49.5611 27.7614C49.57 27.7977 49.5793 27.8458 49.5879 27.907C49.6054 28.0298 49.6182 28.1897 49.6242 28.3849C49.6363 28.7749 49.6207 29.2803 49.5722 29.8643C49.4752 31.0319 49.2494 32.4845 48.8703 33.9099C48.4899 35.3404 47.963 36.7129 47.2785 37.7414C46.591 38.7742 45.797 39.3861 44.8941 39.4682C42.7304 39.6648 37.1466 39.2678 30.9156 37.897C24.6858 36.5265 17.9073 34.2031 13.308 30.6061C9.24225 27.4264 5.74118 22.1174 3.42236 17.3194C2.26545 14.9256 1.4129 12.6797 0.934579 10.9175C0.695003 10.0349 0.553348 9.2882 0.510192 8.71257C0.488615 8.42478 0.492679 8.19228 0.516432 8.01363C0.540882 7.82974 0.581952 7.7358 0.607968 7.69688Z" stroke="currentColor"/>
      </svg>

    '
  ],
  [
    "name" => "Адрес",
    "is_ref" => false,
    "ref" => "",
    "value" => "Abu Dhabi, Box 41318 ",
    "svg" => '
      <svg width="52" height="41" viewBox="0 0 52 41" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M17 26.4668C7.63988 27.4785 1 30.0219 1 32.9995C1 36.8655 12.1929 39.9995 26 39.9995C39.8071 39.9995 51 36.8655 51 32.9995C51 30.0219 44.3601 27.4785 35 26.4668" stroke="currentColor" stroke-linecap="round"/>
        <path d="M37.5 12.2469C37.5 13.8132 36.7974 15.8045 35.6812 17.9566C34.5726 20.0938 33.0889 22.3285 31.5967 24.3643C30.1059 26.3982 28.6139 28.2235 27.494 29.5409C26.9343 30.1993 26.4682 30.7302 26.1423 31.0961C26.0914 31.1532 26.0439 31.2064 26 31.2553C25.9561 31.2064 25.9086 31.1532 25.8577 31.0961C25.5318 30.7302 25.0657 30.1993 24.506 29.5409C23.3861 28.2235 21.8941 26.3982 20.4033 24.3643C18.9111 22.3285 17.4274 20.0938 16.3188 17.9566C15.2026 15.8045 14.5 13.8132 14.5 12.2469C14.5 5.74962 19.6583 0.5 26 0.5C32.3417 0.5 37.5 5.74962 37.5 12.2469Z" stroke="currentColor"/>
        <circle cx="26" cy="12" r="3.5" stroke="currentColor"/>
      </svg>

    '
  ],
];
