<?php

$garantee_header = "Наши гарантии";

$garantee_ref = [
    "text" => "Наши постоянные клиенты – это инвесторы из банковской сферы, нефтегазовой отрасли и частные лица",
    "button" => "Оставить заявку"
];

$garantee_list = [
    [
        "title" => "Репутация",
        "text" => "Наше агентство недвижимости гордится безупречной репутацией, подтвержденной множеством успешных сделок и довольных клиентов.",
        "image" => "/assets/images/guarantee_1.webp"
    ],
    [
        "title" => "Рекомендации",
        "text" => "Мы получаем большинство новых клиентов по рекомендациям наших предыдущих клиентов, что подтверждает наше качество обслуживания и высокий уровень доверия.",
        "image" => "/assets/images/guarantee_2.webp"
    ],
    [
        "title" => "Юридическое сопровождение",
        "text" => "Мы предоставляем полное юридическое сопровождение на каждом этапе сделки, гарантируя безопасность и законность всех процедур.",
        "image" => "/assets/images/guarantee_3.webp"
    ],
    [
        "title" => "Никаких авансов или предоплат",
        "text" => "Мы не требуем авансов или предоплат, работая исключительно на условиях полной прозрачности и доверия.",
        "image" => "/assets/images/guarantee_4.webp"
    ],
    [
        "title" => "Знают и доверяют практически все застройщики ОАЭ",
        "text" => "Мы сотрудничаем с большинством застройщиков ОАЭ, что позволяет нашим клиентам получать лучшие предложения и условия.",
        "image" => "/assets/images/guarantee_5.webp"
    ],
];

