<?php

$review_header = "Отзывы";


$review_ref = [
    "text" => "",
    "button" => "Оставить заявку"
];

$review_texts = [
    [
        "type" => 1,
        "title" => "Григорий Константинович",
        "text" => "Я вам очень благодарен, что вы уделили такое большое количество времени моей сделке, отвечали на огромное количество моих вопросов и все подробно объясняли. С вами очень комфортно работать. Я не самый простой клиент, всегда детально подхожу к задаче, долго анализирую и я чувствовал все время от вас поддержку",
        "city" => "Москва",
        "age" => "55 лет"
    ],
    [
        "type" => 1,
        "title" => "Сергей Владимирович",
        "text" => "Мы не первый год с вами вместе работаем и я всегда прислушиваюсь к вашим советам и вашему мнению. Все инвестиции, которые я с вами сделал, оказались высокого качества. Еще раз говорю вам спасибо за рекомендацию прекрасного проекта Ahad, он показал супер доходность.",
        "city" => "Москва",
        "age" => "46 лет"
    ],
    [
        "type" => 1,
        "title" => "Андрей Юрьевич",
        "text" => "Когда я начал инвестировать в недвижимость Эмиратов, я стал сотрудничать с несколькими агентами и купил недвижимость через несколько разных агентств. Как оказалось через год и через два, купленная с вами недвижимость показала себя как самая успешная инвестиция из всех в части роста цены апартаментов и доходности от аренды. Спасибо за качественное сотрудничество.",
        "city" => "Кипр",
        "age" => "37 лет"
    ],
    [
        "type" => 0,
        "title" => "Анастасия Сергеевна",
        "text" => "После 2 лет сотрудничества/кооперации с разными людьми в Дубае я была очень поражена, насколько много безответственных людей. Знаете, Татьяна, я с Вами абсолютно спокойна, с Вами никогда не было заминок и прочей ерунды и я за это очень признательна, просто человеческая благодарность. Вы очень ответственно относитесь к любому вопросу, мне понятны все шаги и все действия. Вы провели весь процесс продажи квартиры без моего присутствия в Дубае и очень выручили меня. Я видела, сколько хлопот я вам доставила с моей нестандартной ситуацией и очень ценю вашу помощь.",
        "city" => "Красноярск",
        "age" => "39 лет"
    ],
    [
        "type" => 0,
        "title" => "Полина Владимировна",
        "text" => "В очередной раз вы помогаете мне решать вопросы с застройщиком после покупки квартиры. Спасибо, что вы всегда на связи и сразу подключаетесь, чтобы помочь мне. Я не знаю, чтобы я без вас делала. Я вас рекомендую и буду рекомендовать моим знакомым и я очень рада, что работаю именно с вами.",
        "city" => "Санкт Петербург",
        "age" => "50 лет"
    ],
    [
        "type" => 1,
        "title" => "Сергей Николаевич",
        "text" => "Я прочитал новости про развитие эмирата и конкретного места, где мы купили квартиру, я очень рад, что вы мне рекомендовали это место, оно имеет большой потенциал роста. Цена квартиры уже выросла на 50% за полтора года. Я покупал удаленно, полностью доверяя вам, сейчас приехал посмотреть на это место, это супер, мне очень понравилось, я даже не ожидал, что все так красиво. И у нас первая береговая линия. Большое спасибо вам за эту покупку.",
        "city" => "Москва",
        "age" => "64 года"
    ],
    [
        "type" => 1,
        "title" => "Игорь",
        "text" => "Мы не думали, что так много нюансов в процессе покупки квартиры и даже после. Здорово, что мы работаем с вами, вы заранее рассказываете о всех деталях покупки и знаете нюансы каждого застройщика. Было очень полезно услышать преимущества и недостатки района, здания и мы смогли решить все сопутствующие вопросы с вами - получили визу, открыли счет, получили ключи и сдали в аренду. Надеемся на дальнейшее сотрудничество.",
        "city" => "Румыния",
        "age" => "56 лет"
    ]
];
